/**
 * @file provisioning.h
 * @author Systemzeus Inc.
 * @copyright Copyright © 2023 Systemzeus Inc. All rights reserved.
 */
#ifndef PROVISIONING_H_
#define PROVISIONING_H_

#ifdef __cplusplus // Provide Cplusplus Compatibility

extern "C"
{
#endif /* end Provide Cplusplus Compatibility */

// --------------------------------------------------
// ###   システムヘッダの取り込み
// --------------------------------------------------

// --------------------------------------------------
// ユーザ作成ヘッダの取り込み
// --------------------------------------------------

// --------------------------------------------------
// #defineマクロ
// --------------------------------------------------
#define LINKING_INFO_INIT_VALUE "\n\n" /**< Linking Infoの初期値 */

#define LINKING_INFO_DELIMITER "\n" /**< Linking Infoの分割文字*/

#define PROVISIONING_MODE_REQ_STRING     "provisioningModeReq\n"   /**< プロビジョニングモード変更要求 */
#define WIFI_INFO_CHANGE_MODE_REQ_STRING "wifiInfoChangeModeReq\n" /**< Wi-Fi接続先変更モード要求 */
#define COMMAND_NOTHING_STRING           "commandNothing\n"        /**< モードの変更完了。スマホアプリに知らせるために使用する。*/

    // --------------------------------------------------
    // #define関数マクロ
    // --------------------------------------------------

    // --------------------------------------------------
    // typedef定義
    // --------------------------------------------------

    // --------------------------------------------------
    // enumタグ定義（typedefを同時に行う）
    // --------------------------------------------------

    // --------------------------------------------------
    // struct/unionタグ定義（typedefを同時に行う）
    // --------------------------------------------------

    // --------------------------------------------------
    // extern変数宣言
    // --------------------------------------------------

    // --------------------------------------------------
    // 関数プロトタイプ宣言
    // --------------------------------------------------

    // --------------------------------------------------
    // インライン関数
    // --------------------------------------------------

#ifdef __cplusplus
}
#endif

#endif /* end PROVISIONING_H_ */
