/**
 * @file app_version.h
 * @author Systemzeus Inc.
 * @copyright Copyright © 2023 Systemzeus Inc. All rights reserved.
 */
#ifndef APP_VERSION_H_
#define APP_VERSION_H_

#ifdef __cplusplus // Provide Cplusplus Compatibility

extern "C"
{
#endif /* end Provide Cplusplus Compatibility */

    // --------------------------------------------------
    // ###   システムヘッダの取り込み
    // --------------------------------------------------

    // --------------------------------------------------
    // ユーザ作成ヘッダの取り込み
    // --------------------------------------------------

    // --------------------------------------------------
    // #defineマクロ
    // --------------------------------------------------
/**
 * @brief アプリケーションのメジャーバージョン
 */
#ifndef APP_VERSION_MAJOR
#    define APP_VERSION_MAJOR 1
#endif

/**
 * @brief アプリケーションのマイナーバージョン
 */
#ifndef APP_VERSION_MINOR
#    define APP_VERSION_MINOR 0
#endif

/**
 * @brief アプリケーションのビルドバージョン
 */
#ifndef APP_VERSION_BUILD
#    define APP_VERSION_BUILD 0
#endif

    // --------------------------------------------------
    // #define関数マクロ
    // --------------------------------------------------

    // --------------------------------------------------
    // typedef定義
    // --------------------------------------------------

    // --------------------------------------------------
    // enumタグ定義（typedefを同時に行う）
    // --------------------------------------------------

    // --------------------------------------------------
    // struct/unionタグ定義（typedefを同時に行う）
    // --------------------------------------------------

    // --------------------------------------------------
    // extern変数宣言
    // --------------------------------------------------

    // --------------------------------------------------
    // 関数プロトタイプ宣言
    // --------------------------------------------------

    // --------------------------------------------------
    // インライン関数
    // --------------------------------------------------

#ifdef __cplusplus
}
#endif

#endif /* end APP_VERSION_H_ */
